Repository: conquertec/progestock-backend-portfolio
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: An unexpected error occurred. Please try again later.
fr: Une erreur inattendue s'est produite. Veuillez réessayer plus tard.

source: Validation failed. Please check your input.
fr: La validation a échoué. Veuillez vérifier vos données.

source: Authentication credentials were not provided or are invalid.
fr: Les identifiants d'authentification n'ont pas été fournis ou sont invalides.

source: You do not have permission to perform this action.
fr: Vous n'avez pas la permission d'effectuer cette action.

source: The requested resource was not found.
fr: La ressource demandée n'a pas été trouvée.

source: This HTTP method is not allowed for this endpoint.
fr: Cette méthode HTTP n'est pas autorisée pour cet endpoint.

source: Too many requests. Please slow down and try again later.
fr: Trop de requêtes. Veuillez ralentir et réessayer plus tard.

source: An error occurred
fr: Une erreur s'est produite

source: The email or password you entered is incorrect.
fr: L'email ou le mot de passe que vous avez saisi est incorrect.

source: Please verify your email address before logging in.
fr: Veuillez vérifier votre adresse email avant de vous connecter.

source: Your account has been disabled. Please contact support.
fr: Votre compte a été désactivé. Veuillez contacter le support.

source: This link has expired. Please request a new one.
fr: Ce lien a expiré. Veuillez en demander un nouveau.

source: This link is invalid or has already been used.
fr: Ce lien est invalide ou a déjà été utilisé.

source: The verification code is invalid or has expired.
fr: Le code de vérification est invalide ou a expiré.

source: This email address has already been verified.
fr: Cette adresse email a déjà été vérifiée.

source: Google authentication failed. Please try again.
fr: L'authentification Google a échoué. Veuillez réessayer.

source: A user is already registered with this email address.
fr: Un utilisateur est déjà enregistré avec cette adresse email.

source: User not found.
fr: Utilisateur non trouvé.

source: You cannot delete your own account.
fr: Vous ne pouvez pas supprimer votre propre compte.

source: You cannot change your own role.
fr: Vous ne pouvez pas modifier votre propre rôle.

source: Only administrators can perform this action.
fr: Seuls les administrateurs peuvent effectuer cette action.

source: Invitation not found or has expired.
fr: Invitation non trouvée ou expirée.

source: This invitation has already been accepted.
fr: Cette invitation a déjà été acceptée.

source: Password must be at least 8 characters long.
fr: Le mot de passe doit contenir au moins 8 caractères.

source: User is not associated with any company.
fr: L'utilisateur n'est associé à aucune entreprise.

source: Logo file size must not exceed 2MB.
fr: La taille du fichier du logo ne doit pas dépasser 2 Mo.

source: Sales tax rate must be between 0 and 100.
fr: Le taux de taxe de vente doit être compris entre 0 et 100.

source: Brand color must be a valid hexadecimal color code (e.g., #FF5733).
fr: La couleur de marque doit être un code couleur hexadécimal valide (ex: #FF5733).

source: Product not found.
fr: Produit non trouvé.

source: Cannot delete category. It is being used by {count} product(s).
fr: Impossible de supprimer la catégorie. Elle est utilisée par {count} produit(s).

source: Cannot delete location. It contains {count} product(s).
fr: Impossible de supprimer l'emplacement. Il contient {count} produit(s).

source: Insufficient stock available for this operation.
fr: Stock insuffisant pour cette opération.

source: Stock quantity must be a positive number.
fr: La quantité en stock doit être un nombre positif.

source: A product with this SKU already exists.
fr: Un produit avec ce SKU existe déjà.

source: Quote not found.
fr: Devis non trouvé.

source: Invoice not found.
fr: Facture non trouvée.

source: Client not found.
fr: Client non trouvé.

source: Payment amount cannot exceed the outstanding balance.
fr: Le montant du paiement ne peut pas dépasser le solde impayé.

source: This quote has already been converted to an invoice.
fr: Ce devis a déjà été converti en facture.

source: This invoice has already been fully paid.
fr: Cette facture a déjà été entièrement payée.

source: Purchase order not found.
fr: Bon de commande non trouvé.

source: Supplier not found.
fr: Fournisseur non trouvé.

source: This purchase order has already been received.
fr: Ce bon de commande a déjà été reçu.

source: This field is required.
fr: Ce champ est obligatoire.

source: Please enter a valid email address.
fr: Veuillez saisir une adresse email valide.

source: Please enter a valid date.
fr: Veuillez saisir une date valide.

source: Please enter a valid number.
fr: Veuillez saisir un nombre valide.

source: This value is too long.
fr: Cette valeur est trop longue.

source: Failed to send email. Please try again later.
fr: Échec de l'envoi de l'email. Veuillez réessayer plus tard.

source: A database error occurred. Please try again.
fr: Une erreur de base de données s'est produite. Veuillez réessayer.
